/*企业发放的奖金根据利润提成。/
利润(I)低于或等于10万元时，奖金可提10%；100000*0.1
利润高于10万元，低于20万元时，
低于10万元的部分按10%提成，高于10万元的部分，
可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%；
高于100万元时，超过100万元的部分按1%提成。*/
#include<stdio.h>
int main(){
    double i;
    double a1,a2,a3,a4,a5,a;
    printf("你的利润是：\n");
    scanf("%lf",&i);
    a1=100000*0.1;
    a2=a1+100000*0.075;
    a3=a2+200000*0.05;
    a4=a3+200000*0.03;
    a5=a4+400000*0.015;
    if (i<=100000)
    {
        a=i*0.1;
    }else if (i<=200000)
    {
        a=a1+(i-100000)*0.075;
    }else if (i<=400000)
    {
        a=a2+(i-200000)*0.05;
    }else if (i<=600000)
    {
        a=a3+(i-400000)*0.03;
    }else if (i<=1000000)
    {
        a=a4+(i-600000)*0.0015;
    }else if (i<=1000000)
    {
        a=a5+(i-1000000)*0.01;
    }
    printf("提成为：a=%lf",a);
    printf("\n");


}