//计算机二级考试题目
#include<stdio.h>
// （code1） ：喜欢你循环代码
void code1(){
    int line = 0;
    while(line<1000){
        printf("xhn %d\n",line);
        line++;

    }
    if(line>=1000)printf("wyxhn\n");
}
void code2(){
    int a[8]={2,4,6,1,3,7,8,1};
    int b[8]={6,5,3,8,6,4,7,5};
    for(int i=0;i<8;i++){
        for(int j=0;j<8;j++){
            printf("%d:::%d",a[i],b[j]);
            if(j%8==0)printf("\n");
        }
    }
    for(int i=0;i<10;i++){
        printf("——");
    }
}
void code3(){
    /*从键盘任意输入三个整数，将它们按从小到大的顺序输出（要求使用选择结构实现）。*/
    int a,b,c,t;
    scanf("%d%d%d",&a,&b,&c);
    if(a>b)
    {
		t=a;
		a=b;
		b=t;
    }
    if(a>c)
    {
		t=a;
		a=c;
		c=a;
    }
    if(b>c)
    {
		t=b;
		b=c;
		c=t;
    }
    printf("%d\t%d\t%d\n",a,b,c);
}
void code4(){
    /*根据下式计算s的值，其中n由键盘输入。
    说明：(1)要求使用循环实现；(2)输出结果保留4位小数，形式为：s=1.2345
    参考答案：参考运行结果： 输入：2000输出：s=1.5706*/
    int i,n;
    double s=1;
    scanf("%d",&n);
    for(i=1;i<=n;i++)
    {
		s=s*(2*i)*(2*i)/((2*i-1)*(2*i+1));
    }
    printf("s=%.4f\n",s);
}
void code5(){
/*某购物中心根据顾客购买商品的总金额（单位：元）进行打折促销，
        输入顾客购买商品的总金额x（设x是大于0的整数），
        计算并输出顾客应付总金额y（要求使用选择结构实现）。*/
    int x;
    scanf("%d",&x);
    if(x<100){
        printf("%d",x);
    }else if(x>=100&&x<200){
        printf("%d",0.95*x);
    }else if(x>=200&&x<400){
        printf("%d",0.9*x);
    }else if(x>=400){
        printf("%d",0.85*x);
    }
}
void code6(){
    	int n=1;
	double s=0,t;
	while(s<=4)
	{
		t=1.0/(2*n-1);
		s=s+t;
		n++;
	}
	printf("n=%d\n",n-1);
}
void code7(){
/*题目：小明每天坚持跑步，6月份每天的跑步里程（单位：千米）记录在数组a中。计算并输出小明6月份跑步总里程和每天平均值（要求使用循环实现，结果保留2位小数）。
输出格式为：小明6月份跑步总里程：123.45千米平均值：12.34千米
参考答案：参考运行结果：小明6月份跑步总里程：324.91千米 平均值：10.83千米*/
/*小明6月份每天跑步里程*/
	double a[30]={10.25,8.79,9.54,12.1,16.8,10.3,8.98,9.78,11.26,12.9,10.75,8.77,8.54,10.31,13.8,12.3,8.57,9.43,10.28,11.3,11.47,9.49,10.54,11.61,13.85,12.73,8.28,9.87,10.6,11.72}; 
	/*考生在此行下设计程序，不得删除本行*/
	double total=0,aver;
	int i;
	for(i=0;i<30;i++)
		total+=a[i];
	aver=total/30;
	printf("小明6月份跑步总里程：%.2lf千米\n平均值：%.2lf千米\n",total,aver);
}
void code8(){
    /*
    根据公式：
    s=1+(1+2/2!)+(1+2+3/3!)+(1+2+3+4/4!)+(1+2+3+4+***+n/n!)
    (要求使用循环实现)
    */
   int i,n;
   double s=0,t1=0,t2=1;
   printf("输入n：");
   scanf("%d",&n);
   for(i=1;i<=n;i++){
    t1+=i;
    t2*=i;
    s=s+1.0*t1/t2;
   }
   printf("s=%.5f\n",s);

}
void code9(){
/*题目：
小王2022年开车共行驶19388公里，全年共加油38次，
加油金额和相应的汽油价格分别保存在数组a和b中，
试编写程序，计算小王2022年全年加油总金额（单位：元）和总数量（单位：升），
并求全年百公里平均油耗（结果保留两位小数，要求使用循环实现)。
输出格式为：
2022年加油12345.00元，共1234.45升
百公里平均油耗8.36升

*/
	/*2022年每次加油金额数据（单位：元）*/
	int a[38]={300,350,400,300,350,450,400,350,450,430,420,380,350,340,320,370,410,420,370,
		420,450,400,350,450,430,420,380,350,340,320,370,410,420,400,300,350,450,375};
	/*2022年每次加油价格数据（单位：元/升）*/
        float b[38]={7.82,7.95,8.24,8.30,7.95,7.67,7.32,7.56,7.89,7.83,8.12,8.23,8.34,7.97,8.17,
		7.56,7.85,8.14,8.30,7.85,7.57,7.38,7.51,7.84,7.85,8.15,8.23,7.84,7.97,8.37,8.25,8.46,
	    7.43,7.59,7.77,8.15,7.75,7.43};
   /*考生在此行下设计程序，不得删除本行*/
	float total=0,average,s=19388,sum=0;
	int i;
	for(i=0;i<38;i++)
	{
		sum=sum+a[i];
		total=total+a[i]/b[i];
	}
	average=total/s*100;
	printf("2022年加油%.2f元，共%.2f升\n",sum,total);
	printf("百公里平均油耗%.2f升\n",average);
}

#include<math.h>
void code10(){
/*题目：
计算10～99之间（包含10和99）个位数和十位数之差的绝对值为1的数之和。
说明：(1)要求使用循环实现
参考答案：参考运行结果：sum=890
*/
     /*考生在此行下设计程序，不得删除本行*/
	int sum=0,n,a,b;
	for (n=10;n<100;n++)
	{
		a=n%10;
		b=n/10;
		if(abs(a-b)==1)  /*if((a-b)==1||(a-b)==-1)*/
		{
			sum+=n;
		}
	}
	printf("sum=%d\n",sum);
}




void code11(){
/*题目：
输入一个字符，将小写字母循环后移5个位置后输出，其他字符保持不变。如'a'变成'f'，'v'变成'a'。
*/
/*考生在此行下设计程序，不允许删除该行*/
    char ch;
    ch=getchar();
    if(ch>='a'&&ch<='u')
		ch=ch+5;
    else if(ch>='v'&&ch<='z')
		ch=ch-26+5;
    putchar(ch);
    printf("\n"); 
}
void code12(){
/*题目：
根据下式求满足s<10000时的最大正整数n。
s = 2+2(2)+2(3)+.......+2(n)
*/	
 /*考生在此行下设计程序，不得删除本行*/
	int s=0,n=0,t=1;
	while(s<10000)
	{	
		t=t*2;
		s+=t;
		n++;
	}
	printf("n=%d\n",n-1);
}
void code13(){
/*题目：
某博物馆参观人数最大安全容量为5000人，
参观人数达到最大安全容量的90%为预警数，
该馆某天八点开始每隔半小时的进出馆人数分别存储在数组a和b中，
编写程序，计算并输出超过预警数的入馆人数和时间点，统计输出全天超过最大安全容量的次数（要求使用循环实现)。

输出格式为：
人数超过预警!达4567人，警告时间：11点
人数超过预警!达4567人，警告时间：13点半
全天超过最大安全容量0次!

参考答案：
参考运行结果：
入馆人数超过预警!人数达4539人，警告时间：10点半
入馆人数超过预警!人数达4737人，警告时间：11点
入馆人数超过预警!人数达4559人，警告时间：14点
全天超过最大安全容量0次!*/	
/* 八点开始每半小时入馆人数 */
	int a[19]={1265,968,1173,1379,1369,1452,1123,734,627,735,658,1387,1235,740,520,371,0,0,0};
	/* 八点开始每半小时出馆人数 */
        int b[19]={0,0,473,756,786,1052,925,987,745,918,958,989,957,1042,1520,837,1146,928,717};
        /*考生在此行下设计程序，不得删除本行*/
	int i,sum=0,total=5000,warning,count=0;
	warning=total*90/100;//预警数 5000*90%
	for(i=0;i<19;i++)
	{
		sum+=a[i]-b[i];
		if( sum>warning )
		{
			printf("入馆人数超过预警!人数达%d人，警告时间：%d点",sum,8+i/2);
			if(i%2==1)
				printf("半\n");
			else
				printf("\n");
			if(sum>=total) count++;
		}
	}
	printf("全天超过最大安全容量%d次!\n",count);
}
void code14(){
/*
计算并输出a+aa+aaa+...+aa...a（n个a）的值，
n和a的值由键盘输入（其中a的值为1-9之间的整数）。
说明：(1)要求使用循环实现；(2)输出结果形式为：
sum=123456
参考运行结果：
输入：3 2
输出：sum=246
*/
int sum=0,t=0,a,n,i;
scanf("%d%d",&n,&a);
for(i=0;i<n;i++){
	t=t*10+a;
	sum+=t;

}
printf("%d",sum);

}
void code15(){
/*
输入三角形的三条边，判断该三角形是不是直角三角形，
若是输出"Yes"，否则输出"No"（要求使用选择结构实现）。*/
int a,b,c;
scanf("%d%d%d",&a,&b,&c);
if(a>0&&b>0&&c>0){
	if((a*a+b*b==c*c)||(a*a+c*c==b*b)||(b*b+c*c==a*a)){
		printf("Yes");
	}else printf("No");
}else printf("Error");
}
void code16(){
/*题目：
某班级有30名同学，《大学英语》课程的期末成绩存储在数组a中，数组元素为-1表示缺考，统计并输出成绩高于平均成绩的学生人数。    
输出格式为：
成绩高于平均成绩的学生 15 人
参考答案：参考运行结果：成绩高于平均成绩的学生 17 人
*/	
/*期末成绩*/
	int a[30]={65,86,26,65,75,78,56,84,85,-1,74,69,33,78,76,63,88,95,82,89,97,78,66,83,85,72,91,-1,78,70}; 
	/*考生在此行下设计程序，不得删除本行*/
	int i,m=0,n=0;
	float ave=0;
	for(i=0;i<30;i++)
		if(a[i]!=-1)
		{
	    	ave+=a[i];
			m++;
		}
	ave/=m;
	for(i=0;i<30;i++)
		if(a[i]>ave)
			n++;
	printf("成绩高于平均成绩的学生 %d 人\n",n);
}
void code17(){
	/*
	 题目：
输入一个字符，将小写字母循环后移5个位置后输出，
其他字符保持不变。如'a'变成'f'，'v'变成'a'。
	*/
char ch;
scanf("%c",&ch);
if(ch>='a'&&ch<='u'){
	ch=ch+5;
}else if(ch>='v'&&ch<='z'){
	ch=ch-26+5;
}
printf("%c",ch);
printf("\n");

}
void code18(){
	/*
	键盘输入梯形的上底长a、下底长b和高h，
	计算并输出梯形的面积s。计算公式如下：  
	s=( (a+b)h/2 )
	*/
	/*考生在此行下设计程序，不允许删除该行*/
	double s,a,b,h;
	printf("请输入a b h:");
	scanf("%lf%lf%lf",&a,&b,&h);
	if(a<=0||b<=0||h<=0)
		printf("输入数据有误\n");
	else
	{
		s=(a+b)*h/2;
		printf("s=%lf\n",s);
	}
}
void code19(){
	/*
	题目：
根据下式求s的值（要求使用循环实现）。
s=1+1/2 + 1/2(2)+ ****+1/2(18)
参考答案：
参考运行结果：
s=2.00000
	*/ 
	/*考生在此行下设计程序，不得删除本行*/
int i;
double s=1,t=1;
for(i=1;i<=18;i++){
	t=t/2;
	s=s+t;
}
printf("s=%.5lf\n",s);
}
void code20(){
	/*
	题目：
班级晚会，预备用500元买签字笔、笔记本、钢笔三种物品作为晚会奖品。
其中，
签字笔2元一支，
笔记本7元一本，
钢笔15元一支，
要求签字笔不少于50支、笔记本不少于10本、钢笔不少于5支。
编程统计有多少种买法(要求使用循环实现)。
输出格式为：
共有 100 种买法
参考答案：参考运行结果：共有 170 种买法
*/	
/*考生在此设计程序*/
int co=0;//计数
int a,b,c;//a 签字笔 ，b  笔记本，c 钢笔
for (a=50;a<250;a++){
	for(b=10;b<71;b++){
		for(c=5;c<33;c++){
			if(a*2+b*7+c*15==500){
				co++;
			}
		}
	}
}
printf("%d",co);
} 


void code21(){
int a=3,b=2,c=1;
if (a>b&&a>c)//if(a>b>c)这种写法错误
	a=b;
else
	a=c;
printf("%d",a);
}
// 
/*
a>b?a:b;
什么意思呢，首先会计算表达式1的值，
看看是真还是假，也就是成立还是不成立，
如果表达式1成立，那么这个三目运算符整体的值呢就是表达式2的值，
否则（也就是表达式1不成立），这个三目运算符整体的值就是表达式3的值。 
a>b?a:b
如果a>b则返回值为a 
如果a<b则返回值为b
*/
void code22(){
int a,b;
for(a=1,b=1;a<=100;a++)
{
    if(b>=10) break;
    if(b%5==1)b+=5;
}
printf("%d\n",a); 
}
void code23(){
	int s=0,n=0,t=1;
	while(s<10000){
		t=t*2;
		s+=t;
		n++;
	}
	printf("%d",n-1);
}

//2023.12.27
void code24(){
	int s=0,t=1,n=0,i;
	while(s<10000){
		t=t*2;
		s+=t;
		n++;
	}
	printf("%d",n-1);
}
void code25(){
/* 八点开始每半小时入馆人数 */ 
 int a[19]={1265,968,1173,1379,1369,1452,1123,734,627,735,658,1387,1235,740,520,371,0,0,0}; 
 /* 八点开始每半小时出馆人数 */ 
 int b[19]={0,0,473,756,786,1052,925,987,745,918,958,989,957,1042,1520,837,1146,928,717}; 
 /*考生在此行下设计程序，不得删除本行*/ 
 int m,n,i;
 for(i=0;i<19;i++){
	
 }
}
//
void code26(){
	printf("*********************欢迎进入学生管理系统**********************\n");
	struct studey
	{
		char name[10];
		int sex;
		int six;
		int xh;
	}STU[3];
	int i,j, s, a=1;
	for (i = 0; i < 3; i++) {
		printf("输入第%d个姓名：", i + 1);
		scanf("%s", &STU[i].name);
	}
	for (i = 0; i < 3; i++) {
		printf("输入%s对应的学号：", STU[i].name);
		scanf("%d", &STU[i].xh);
	}
	for (i = 0; i < 3; i++) {
		printf("输入第%d个姓名对应的年龄：", i + 1);
		scanf("%d", &STU[i].six);
	}
	for (i = 0; i < 3; i++) {
		printf("输入第%d个姓名对应的性别(输入0(男生)，1(女生))：", i + 1);
		scanf("%d", &STU[i].sex);
	}
	printf("\n 序号 \t姓名 \t性别 \t年龄 \t学号 \n");
char x ='男';
char y ='女';
char z ;

	for (i = 0; i < 3; i++) {
		if (STU[i].sex == 0) {
			z = x;
		}
		else if (STU[i].sex == 1) {
			z = y;
		}
		printf("%d \t%s \t%c \t%d \t%d \n", a, STU[i].name, z, STU[i].six, STU[i].xh);
		a++;
	}
}
int main(){
    code26();
    return 0;
}